Model: "model_transfer"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_1_input (InputLayer)  [(None, 120, 320, 1)]    0         
                                                                 
 conv2d_1 (Conv2D)           (None, 58, 158, 32)       832       
                                                                 
 max_pooling2d_1 (MaxPooling  (None, 29, 79, 32)       0         
 2D)                                                             
                                                                 
 conv2d_2 (Conv2D)           (None, 27, 77, 64)        18496     
                                                                 
 max_pooling2d_2 (MaxPooling  (None, 13, 38, 64)       0         
 2D)                                                             
                                                                 
 conv2d_3 (Conv2D)           (None, 11, 36, 64)        36928     
                                                                 
 max_pooling2d_3 (MaxPooling  (None, 5, 18, 64)        0         
 2D)                                                             
                                                                 
 flatten_1 (Flatten)         (None, 5760)              0         
                                                                 
 dense_1 (Dense)             (None, 128)               737408    
                                                                 
 dense_2 (Dense)             (None, 10)                1290      
                                                                 
 dense_13 (Dense)            (None, 512)               1408      
                                                                 
 dense_14 (Dense)            (None, 64)                8256      
                                                                 
 dense_15 (Dense)            (None, 5)                 325       
                                                                 
=================================================================
Total params: 804,943
Trainable params: 748,687
Non-trainable params: 56,256
_________________________________________________________________