Model: "resnet50"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 resnet50 (Functional)       (None, 2048)              23587712  
                                                                 
=================================================================
Total params: 23,587,712
Trainable params: 0
Non-trainable params: 23,587,712